---
kind: type
id: T:Autodesk.Revit.UI.UIFabricationUtils
source: html/92583384-10a7-9134-932c-85b7487b45bd.htm
---
# Autodesk.Revit.UI.UIFabricationUtils

General Fabrication UI utility methods in Revit UI.

## Syntax (C#)
```csharp
public static class UIFabricationUtils
```